<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"695ffec5dcf7bb4ea3237b91b9127237290ca14327616c5d2d4bf2e9615dcba3","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1297 at https://github.com/cal-itp/data-infra/actions/runs/20793196992","plan_out_hash":"1e6c39c47861f2944d8bad9c57f888c256e0f59fda18e1e09c8b8690f3064341","plan_hash":"6db46c5bbfa1fb49b32c4f83341624e593282533eb88845f8ffc5902c9b0835f","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-dags["macros/define_day_of_week.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "CWM3cA==" -> (known after apply)
!~      detect_md5hash      = "YvfVPHIx1OMIXLV4MUp3RA==" -> "different hash"
!~      generation          = 1767395825147960 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/macros/define_day_of_week.sql"
!~      md5hash             = "YvfVPHIx1OMIXLV4MUp3RA==" -> (known after apply)
        name                = "data/warehouse/macros/define_day_of_week.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/dim_stop_arrivals.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs/dim_stop_arrivals.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs/dim_stop_arrivals.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_daily_feed_scheduled_service_summary.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "0ADmtg==" -> (known after apply)
!~      detect_md5hash      = "yRixUFfYICRBIW7HWOW6yA==" -> "different hash"
!~      generation          = 1764958906072081 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_daily_feed_scheduled_service_summary.sql"
!~      md5hash             = "yRixUFfYICRBIW7HWOW6yA==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_daily_feed_scheduled_service_summary.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1297](https://github.com/cal-itp/data-infra/actions/runs/20793196992)